jonacappelle/nRF52-DCU/main.c
/**
 * Copyright (c) 2016 - 2020, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include "nordic_common.h"
#include "app_error.h"
#include "app_uart.h"
#include "ble_db_discovery.h"
#include "app_timer.h"
#include "app_util.h"
#include "bsp_btn_ble.h"
#include "ble.h"
#include "ble_gap.h"
#include "ble_hci.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"
#include "ble_nus_c.h"
#include "nrf_ble_gatt.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_ble_scan.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

// Own packages
#include "nrf_delay.h"
#include "ble_conn_state.h"
#include "boards.h"
#include "nrf.h"
#include "nrf_drv_gpiote.h"

// TimeSync
#include "time_sync.h"
#include "nrf_gpiote.h"
#include "nrf_ppi.h"
#include "nrf_timer.h"

// UARTE using easyDMA
#include "nrf_drv_uart.h"
#include "app_fifo.h"

// Application scheduler
#include "app_scheduler.h"

// IMU Params
#include "imu_params.h"

// Receive data from Thingy motion service
#include "ble_tes_c.h"




// Create a FIFO structure
typedef struct buffer
{
    app_fifo_t uart_dma_difo;
    app_fifo_t received_data_fifo;  
    uint8_t uart_dma_tx_buff[100];
}BUFFER;

// Initialisation of struct to keep track of different buffers
BUFFER buffer;


typedef struct imu
{
    bool gyro_enabled;
    bool accel_enabled;
    bool mag_enabled;
    bool quat6_enabled;
    bool quat9_enabled;
    bool euler_enabled;
    uint32_t period; // period in milliseconds (ms)
    uint16_t packet_length;
    int received_packet_counter;
    nrf_drv_uart_t uart;
    uint32_t evt_scheduled;
} IMU;

// Initialisation of IMU struct
IMU imu = {
    .received_packet_counter = 0,
    .evt_scheduled = 0,
    .uart = NRF_DRV_UART_INSTANCE(0),
};


// APP Scheduler
#define SCHED_MAX_EVENT_DATA_SIZE APP_TIMER_SCHED_EVENT_DATA_SIZE /**< Maximum size of scheduler events. */
#define SCHED_QUEUE_SIZE 200                                      /**< Maximum number of events in the scheduler queue. */

#define SYNC_FREQ 2 // Hz
static bool m_gpio_trigger_enabled;

/////////////// LED BUTTON BLINK /////////////////////
#define SPARKFUN_LED 7
#define SPARKFUN_BUTTON 6

#define PIN_IN BUTTON_1
#define PIN_OUT LED_1
/////////////// LED BUTTON BLINK /////////////////////

#define APP_BLE_CONN_CFG_TAG 1  /**< Tag that refers to the BLE stack configuration set with @ref sd_ble_cfg_set. The default tag is @ref BLE_CONN_CFG_TAG_DEFAULT. */
#define APP_BLE_OBSERVER_PRIO 3 /**< BLE observer priority of the application. There is no need to modify this value. */

#define UART_TX_BUF_SIZE 2048 /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE 2048 /**< UART RX buffer size. */

#define NUS_SERVICE_UUID_TYPE BLE_UUID_TYPE_VENDOR_BEGIN /**< UUID type for the Nordic UART Service (vendor specific). */

#define ECHOBACK_BLE_UART_DATA 0 //1                                       /**< Echo the UART data that is received over the Nordic UART Service (NUS) back to the sender. */

/* CHANGES */
//BLE_NUS_C_DEF(m_ble_nus_c);                                             /**< BLE Nordic UART Service (NUS) client instance. */
BLE_NUS_C_ARRAY_DEF(m_ble_nus_c, NRF_SDH_BLE_CENTRAL_LINK_COUNT); /**< BLE Nordic UART Service (NUS) client instances. */
/* END CHANGES */
BLE_TES_C_ARRAY_DEF(m_thingy_tes_c, NRF_SDH_BLE_CENTRAL_LINK_COUNT);                  /**< Structure used to identify the battery service. */



NRF_BLE_GATT_DEF(m_gatt);        /**< GATT module instance. */
BLE_DB_DISCOVERY_DEF(m_db_disc); /**< Database discovery module instance. */
NRF_BLE_SCAN_DEF(m_scan);        /**< Scanning Module instance. */
NRF_BLE_GQ_DEF(m_ble_gatt_queue, /**< BLE GATT Queue instance. */
               NRF_SDH_BLE_CENTRAL_LINK_COUNT,
               NRF_BLE_GQ_QUEUE_SIZE);

static uint16_t m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - OPCODE_LENGTH - HANDLE_LENGTH; /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
//static uint16_t m_ble_nus_max_data_len = 247 - OPCODE_LENGTH - HANDLE_LENGTH; /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */

// Event handler DIY
void data_evt_sceduled(void *p_event_data, uint16_t event_size)
{
    nrf_gpio_pin_set(22);
    uint32_t err_code;

    while (imu.evt_scheduled > 0)
    {
        NRF_LOG_INFO("App scheduler execute: %d", imu.evt_scheduled);
        NRF_LOG_FLUSH();

        uint32_t classification_byte_len = 1;
        uint8_t classification_byte[classification_byte_len];

        bool read_success = false;
        uint32_t temp_len;
        float quat[4];
        float other[3];
        char string_send[200];

        // Get 1 byte from buffer to determine which sort of data we are dealing with
        if (app_fifo_read(&buffer.received_data_fifo, classification_byte, &classification_byte_len) == NRF_SUCCESS)
        {
            switch (classification_byte[0])
            {
            case ENABLE_QUAT6:
                // Get 4 floats
                temp_len = 4 * sizeof(float);
                // NRF_LOG_INFO("temp_len: %d", temp_len);
                if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)quat, &temp_len) == NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Read QUAT6");
                    NRF_LOG_INFO("%d %d %d %d", 1000*quat[0], 1000*quat[1], 1000*quat[2], 1000*quat[3]);
                    read_success = true;
                    sprintf(string_send, "w%.2fwa%.2fab%.2fbc%.2fc\n", quat[0], quat[1], quat[2], quat[3]);
                    NRF_LOG_INFO("%s", string_send);
                }
                break;
            case ENABLE_QUAT9:
                // Get 4 floats
                temp_len = 4 * sizeof(float);
                // NRF_LOG_INFO("temp_len: %d", temp_len);
                if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)quat, &temp_len) == NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Read QUAT9");
                    NRF_LOG_INFO("%d %d %d %d", 1000*quat[0], 1000*quat[1], 1000*quat[2], 1000*quat[3]);
                    read_success = true;
                    sprintf(string_send, "w%fwa%fab%fbc%fc\n", quat[0], quat[1], quat[2], quat[3]);
                    NRF_LOG_INFO("%s", string_send);
                }
                break;
            case ENABLE_EULER:
                // Get 3 floats
                temp_len = 3 * sizeof(float);
                if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)other, &temp_len) == NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Read EULER");
                    read_success = true;
                    // Convert to string
                    sprintf(string_send, "Euler: x: %f	y: %f	z: %f\n", other[0], other[1], other[2]);
                }
                break;
            case ENABLE_GYRO:
                // Get 3 floats
                temp_len = 3 * sizeof(float);
                if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)other, &temp_len) == NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Read GYRO");
                    read_success = true;
                    // Convert to string
                    sprintf(string_send, "Gyro: x: %.2f	y: %.2f	z: %.2f\n", other[0], other[1], other[2]);
                }
                break;
            case ENABLE_ACCEL:
                // Get 3 floats
                temp_len = 3 * sizeof(float);
                if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)other, &temp_len) == NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Read ACC");
                    read_success = true;
                    // Convert to string
                    sprintf(string_send, "Acc: x: %.2f	y: %.2f	z: %.2f\n", other[0], other[1], other[2]);
                }
                break;
            case ENABLE_MAG:
                // Get 3 floats
                temp_len = 3 * sizeof(float);
                if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)other, &temp_len) == NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Read MAG");
                    read_success = true;
                    // Convert to string
                    sprintf(string_send, "Mag: x: %f	y: %f	z: %f\n", other[0], other[1], other[2]);
                }
                break;
            default:
                // in case of error
                NRF_LOG_INFO("Error detecting classification_byte: %X", classification_byte[0]);
                break;
            }
        }

        // Get data from FIFO buffer if data is correctly recognized
        if (read_success)
        {

            // NRF_LOG_INFO("read_success");
            // NRF_LOG_FLUSH();

            uint32_t string_len = 0;
            do
            {
                string_len++;
            } while (string_send[string_len] != '\n');
            string_len++;

            // Put the data in FIFO buffer
            err_code = app_fifo_write(&buffer.uart_dma_difo, (uint8_t *)string_send, &string_len);
            if (err_code == NRF_ERROR_NO_MEM)
            {
                NRF_LOG_INFO("UART FIFO BUFFER FULL!");
            }

            if (err_code == NRF_SUCCESS)
            {
                //								NRF_LOG_INFO("Data in FIFO");
                // The new byte has been added to FIFO. It will be picked up from there
                // (in 'uart_event_handler') when all preceding bytes are transmitted.
                // But if UART is not transmitting anything at the moment, we must start
                // a new transmission here.
                if (!nrf_drv_uart_tx_in_progress(&imu.uart))
                {
                    //										NRF_LOG_INFO("TX not in progress");
                    // This operation should be almost always successful, since we've
                    // just added a byte to FIFO, but if some bigger delay occurred
                    // (some heavy interrupt handler routine has been executed) since
                    // that time, FIFO might be empty already.
                    if (app_fifo_read(&buffer.uart_dma_difo, buffer.uart_dma_tx_buff, &string_len) == NRF_SUCCESS)
                    {
                        //												NRF_LOG_INFO("FIFO read");
                        do
                        {
                            err_code = nrf_drv_uart_tx(&imu.uart, buffer.uart_dma_tx_buff, (uint8_t)string_len);
                            if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                            {
                                NRF_LOG_ERROR("nrf_drv_uart_tx failed");
                                APP_ERROR_CHECK(err_code);
                            }
                        } while (err_code == NRF_ERROR_BUSY);
                        //												NRF_LOG_INFO("UART TX OK");
                    }
                }
            }
            imu.evt_scheduled--; // Needs to be here: problem: can skip some malformed packets - otherwise the app_scheduler will continue to execute and block the cpu
        }
        
