jonacappelle/nRF52-DCU/main.c
/////////////// LED BUTTON BLINK /////////////////////
void in_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    nrf_drv_gpiote_out_toggle(PIN_OUT);

    /* CHANGES */

    NRF_LOG_INFO("BUTTON PRESS");

    /* END CHANGES */
}


char const *phy_str(ble_gap_phys_t phys)
{
    static char const *str[] =
        {
            "1 Mbps",
            "2 Mbps",
            "Coded",
            "Unknown"};

    switch (phys.tx_phys)
    {
    case BLE_GAP_PHY_1MBPS:
        return str[0];

    case BLE_GAP_PHY_2MBPS:
    case BLE_GAP_PHY_2MBPS | BLE_GAP_PHY_1MBPS:
    case BLE_GAP_PHY_2MBPS | BLE_GAP_PHY_1MBPS | BLE_GAP_PHY_CODED:
        return str[1];

    case BLE_GAP_PHY_CODED:
        return str[2];

    default:
        return str[3];
    }
}


void conn_evt_len_ext_set(void)
{
    ret_code_t err_code;
    ble_opt_t opt;

    memset(&opt, 0x00, sizeof(opt));
    opt.common_opt.conn_evt_ext.enable = 1;

    err_code = sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT, &opt);
    APP_ERROR_CHECK(err_code);
}

static void usr_uarte_evt_handler(nrf_drv_uart_event_t *p_event, void *p_context)
{
    uint32_t err_code;

    switch (p_event->type)
    {
    case NRF_DRV_UART_EVT_TX_DONE: ///< Requested TX transfer completed.
    {
        uint32_t index = 255;
        // Get next bytes from FIFO.
        if (app_fifo_read(&buffer.uart_dma_difo, buffer.uart_dma_tx_buff, &index) == NRF_SUCCESS)
        {
            nrf_drv_uart_tx(&imu.uart, buffer.uart_dma_tx_buff, (uint8_t)index);
            //								NRF_LOG_INFO("index evt %d", index);
            //								NRF_LOG_INFO("Send next byte from evt handler");
        }
        else
        {
                // Last byte from FIFO transmitted, notify the application.
                // app_uart_event.evt_type = APP_UART_TX_EMPTY;
                // m_event_handler(&app_uart_event);
                NRF_LOG_INFO("UART TX EMPTY");
        }
        NRF_LOG_INFO("UART TX done");
        break;
    }
    case NRF_DRV_UART_EVT_RX_DONE: ///< Requested RX transfer completed.
        break;
    case NRF_DRV_UART_EVT_ERROR: ///< Error reported by UART peripheral.
        NRF_LOG_INFO("Error in NRF_DRV_UART_EVT_ERROR");
        break;
    default:
        break;
    }
}

void uart_dma_init()
{
    ret_code_t err_code;

    nrf_drv_uart_config_t const uart_config_params = {
        .pseltxd = TX_PIN_NUMBER,
        .pselrxd = RX_PIN_NUMBER,
        .pselcts = CTS_PIN_NUMBER,
        .pselrts = RTS_PIN_NUMBER,
        .p_context = NULL,
        .hwfc = (nrf_uart_hwfc_t)UART_DEFAULT_CONFIG_HWFC,
        .parity = (nrf_uart_parity_t)UART_DEFAULT_CONFIG_PARITY,
        .baudrate = (nrf_uart_baudrate_t)UART_BAUDRATE_BAUDRATE_Baud1M,
        .interrupt_priority = UART_DEFAULT_CONFIG_IRQ_PRIORITY, //NRF_DRV_UART_DEFAULT_CONFIG_USE_EASY_DMA                                 \ // Yes, use easyDMA!
    };

    err_code = nrf_drv_uart_init(&imu.uart, &uart_config_params, usr_uarte_evt_handler);

    APP_ERROR_CHECK(err_code);
}



void set_imu_packet_length()
{
    imu.packet_length = 0;

    if (imu.gyro_enabled)
    {
        imu.packet_length += 3 * sizeof(float);
    }
    if (imu.accel_enabled)
    {
        imu.packet_length += 3 * sizeof(float);
    }
    if (imu.mag_enabled)
    {
        imu.packet_length += 3 * sizeof(float);
    }
    if (imu.quat6_enabled)
    {
        imu.packet_length += 4 * sizeof(float);
    }
    if (imu.quat9_enabled)
    {
        imu.packet_length += 4 * sizeof(float);
    }
    if (imu.euler_enabled)
    {
        imu.packet_length += 3 * sizeof(float);
    }

    NRF_LOG_INFO("Packet Len set to: %d", imu.packet_length);
}





void thingy_tes_c_evt_handler(ble_thingy_tes_c_t * p_ble_tes_c, ble_tes_c_evt_t * p_evt)
{

nrf_gpio_pin_set(11);

    switch (p_evt->evt_type)
    {
        ret_code_t err_code;

        case BLE_THINGY_TES_C_EVT_DISCOVERY_COMPLETE:
        {
            err_code = ble_tes_c_handles_assign(&m_thingy_tes_c[p_evt->conn_handle],
                                                p_evt->conn_handle,
                                                &p_evt->params.peer_db);
            NRF_LOG_INFO("Thingy Environment service discovered on conn_handle 0x%x.", p_evt->conn_handle);
            
            // Enable notifications - in peripheral this equates to turning on the sensors
            err_code = ble_tes_c_quaternion_notif_enable(&m_thingy_tes_c[p_evt->conn_handle]);
            APP_ERROR_CHECK(err_code);
            // err_code = ble_tes_c_adc_notif_enable(&m_thingy_tes_c[p_evt->conn_handle]);
            // APP_ERROR_CHECK(err_code);
            // err_code = ble_tes_c_euler_notif_enable(&m_thingy_tes_c[p_evt->conn_handle]);
            // APP_ERROR_CHECK(err_code);
            // err_code = ble_tes_c_raw_notif_enable(&m_thingy_tes_c[p_evt->conn_handle]);
            // APP_ERROR_CHECK(err_code);

        }
        break;

        case BLE_TMS_EVT_QUAT:
        {
            imu.received_packet_counter++;
            NRF_LOG_INFO("%d", imu.received_packet_counter);

            float quat_buff[4];
            uint32_t quat_buff_len = sizeof(quat_buff);

            #define FIXED_POINT_FRACTIONAL_BITS_QUAT        30

            quat_buff[0] = ((float)p_evt->params.value.quat_data.w / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_QUAT));
            quat_buff[1] = ((float)p_evt->params.value.quat_data.x / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_QUAT));
            quat_buff[2] = ((float)p_evt->params.value.quat_data.y / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_QUAT));
            quat_buff[3] = ((float)p_evt->params.value.quat_data.z / (float)(1 << FIXED_POINT_FRACTIONAL_BITS_QUAT));
            
            
            NRF_LOG_INFO("quat: %d %d  %d  %d", (int)(quat_buff[0]*1000), (int)(quat_buff[1]*1000), (int)(quat_buff[2]*1000), (int)(quat_buff[3]*1000));

            // // Put the received data in FIFO buffer
            // err_code = app_fifo_write(&buffer.received_data_fifo, quat_buff, &quat_buff);
            // if (err_code == NRF_ERROR_NO_MEM)
            // {
            //     NRF_LOG_INFO("RECEIVED DATA FIFO BUFFER FULL!");
            // }
            // if (err_code == NRF_SUCCESS)
            // {
            //     // Signal to event handler to execute sprintf + start UART transmission
            //     // If there are already events in the queue
            //     if (imu.evt_scheduled > 0)
            //     {
            //         imu.evt_scheduled++;
            //     }
            //     // If there are not yet any events in the queue, schedule event. In gpiote_evt_sceduled all callbacks are called
            //     else
            //     {
            //         imu.evt_scheduled++;
            //         err_code = app_sched_event_put(0, 0, data_evt_sceduled);
            //         APP_ERROR_CHECK(err_code);
            //     }
            // }
        }
        break;
        
        case BLE_TMS_EVT_EULER:
        {
            float euler_buff[3];
            uint32_t euler_buff_len = sizeof(euler_buff);

            #define FIXED_POINT_FRACTIONAL_BITS_EULER       16

